player_data = {
    "준협": [
        {
            "이름": "커리",            # 캐릭터 이름
            "주포지션": "PG",         # 주 포지션 (하나만!)
            "부포지션": [],           # 부 포지션 없으면 빈 리스트
            "수비": "Off"             # 수비 능력 없음
        },
        {
            "이름": "웸비",          # 또 다른 캐릭터 이름
            "주포지션": "C",          # 주 포지션
            "부포지션": ["PF"],       # 부 포지션
            "수비": "Off"              # 수비 능력 없음
        },
        {
            "이름": "모란트",            
            "주포지션": "SG",         
            "부포지션": [],           
            "수비": "On"             
        },
        {
            "이름": "돌트",            
            "주포지션": "SF",         
            "부포지션": ["SG", "PF"],           
            "수비": "On"             
        },
        {
            "이름": "마포주",            
            "주포지션": "SF",         
            "부포지션": ["PF"],           
            "수비": "Off"             
        },
        {
            "이름": "르브론",            
            "주포지션": "SF",         
            "부포지션": ["PF"],           
            "수비": "Off"             
        },
        {
            "이름": "반케로",            
            "주포지션": "PF",         
            "부포지션": ["SF"],           
            "수비": "Off"             
        },
        {
            "이름": "SGA",            
            "주포지션": "PG",         
            "부포지션": ["SG"],           
            "수비": "On"             
        }
    ],
    "원영": [
        {
            "이름": "원영",            
            "주포지션": "SF",         
            "부포지션": ["PF"],           
            "수비": "On"             
        },
        {
            "이름": "노비츠키",          
            "주포지션": "PF",          
            "부포지션": [],       
            "수비": "Off"              
        },
        {
            "이름": "코비",            
            "주포지션": "SG",         
            "부포지션": ["SF"],           
            "수비": "On"             
        },
        {
            "이름": "탐슨",            
            "주포지션": "SG",         
            "부포지션": ["SF"],           
            "수비": "On"             
        },
        {
            "이름": "즈루",            
            "주포지션": "PG",         
            "부포지션": [],           
            "수비": "On"             
        },
        {
            "이름": "고든",            
            "주포지션": "PF",         
            "부포지션": ["SF"],           
            "수비": "Off"             
        },
        {
            "이름": "오닐",            
            "주포지션": "C",         
            "부포지션": [],           
            "수비": "Off"             
        }
    ],
    "태화": [
        {
            "이름": "레너드",            
            "주포지션": "SF",         
            "부포지션": ["SG", "PF"],           
            "수비": "On"             
        },
        {
            "이름": "듀란트",          
            "주포지션": "PF",          
            "부포지션": ["SF"],       
            "수비": "Off"              
        },
        {
            "이름": "요키치",            
            "주포지션": "C",         
            "부포지션": [],           
            "수비": "Off"             
        },
        {
            "이름": "하든",            
            "주포지션": "PG",         
            "부포지션": ["SG"],           
            "수비": "Off"             
        },
        {
            "이름": "레이앨런",            
            "주포지션": "SG",         
            "부포지션": ["SF"],           
            "수비": "On"             
        }
    ]
}
